import config


class AppealText:
    @staticmethod
    def get(language, violation_data):
        if language == config.BY:
            return AppealText.belarusian(violation_data)
        else:
            return AppealText.russian(violation_data)

    @staticmethod
    def belarusian(violation_data):
        return f'''
Прашу вас прыняць меры ў дачыненні да ўладальніка транспартнага сродку, які здзейсніў парушэнне правілаў прыпынку і стаянкі.

Прашу прыцягнуць да адказнасці ў адпаведнасці з Кодэксам Рэспублікі Беларусь аб адміністрацыйных правапарушэннях, артыкул 18.22 «Парушэнне правілаў прыпынку і стаянкі транспартнага сродку, а таксама іншых правілаў дарожнага руху», і азнаёміць мяне з прынятымі мерамі.

Спасылкі на фатаграфіі:
{violation_data['photos']}

Звесткі аб парушальніку:

Дзяржнумар транспартнага сродку: {violation_data['vehicle_number']}
Месца парушэння (адрас): {violation_data['address']}
Дата і час парушэння: {violation_data['datetime']}

{violation_data['remark']}

Прашу зарэгістраваць сапраўдны зварот у адпаведнасці з Законам «Аб зваротах грамадзян і юрыдычных асоб» і ў адпаведнасці з патрабаваннямі ч. 5 арт. 10 дадзенага Закона і абзацамі 6, 13 арт. 22 Закона «Аб органах унутраных спраў Рэспублікі Беларусь» даручыць адпаведнаму падраздзяленню ОУС правядзенне мерапрыемстваў, накіраваных на ўстанаўленне вышэйзгаданых асоб з мэтай прыцягнення іх да адпаведнай адміністрацыйнай адказнасці за парушэнне правілаў стаянкі транспартнага сродку.

Падставай да пачатку адміністрацыйнага працэсу ў дадзеным выпадку ў адпаведнасці з пунктам 9 Інструкцыі аб парадку прыёму, рэгістрацыі, разгляду і ўліку органамі ўнутраных спраў заяў і паведамленняў аб злачынствах, адміністрацыйных правапарушэннях і інфармацыі пра здарэнні, зацверджанай пастановай МУС ад 08.01.2019 № 5, прашу лічыць непасрэднае выяўленне прыкмет адміністрацыйнага правапарушэння супрацоўнікам АУС, на разглядзе якога будзе знаходзіцца сапраўдны мой зварот, зарэгістраваны ў падраздзяленні рэжымна-сакрэтнай дзейнасці (канцылярыі).

Звяртаю увагу, што, згодна з пунктам 9 названай Інструкцыі, непасрэднае выяўленне прыкмет адміністрацыйнага правапарушэння не заключаецца ў тым, каб супрацоўнікі АУС абавязкова з'яўляліся відавочцамі правапарушэння, і што ў дадзеным выпадку супрацоўнікам АУС павінны быць складзены рапарт аб непасрэдным выяўленні прыкмет адміністрацыйнага правапарушэння.

У ходзе вядзення адміністрацыйнага працэсу я гатовы(ая) даць тлумачэнні ў якасці сведкі, бо з'яўляюся сведкам названых парушэнняў ПДР.

На падставе часткі 2 артыкула 18 і часткі 2 артыкула 32 Закона РБ «Аб інфармацыі, інфарматызацыі і абароне інфармацыі» ад 10 лістапада 2008 г. №455-3 (у рэдакцыі ад 11.05.2016) патрабую не выдаваць мае персанальныя даныя асобе, у адносінах да якой вядзецца адміністрацыйны працэс.

На падставе арт. 7 і ч. 5 арт. 25 Закона «Аб зваротах грамадзян і юрыдычных асоб» прашу накіраваць адказ на сапраўдны зварот на адрас маёй электроннай пошты <b>__EMAIL__</b>, у якім пазначыць звесткі аб прынятых мерах у адпаведнасці з кампетэнцыяй органаў унутраных спраў і патрабаваннямі названых нарматыўных прававых актаў.

З павагай, {violation_data['sender_name']}.

Дзякуй за вашу службу!
'''

    @staticmethod
    def russian(violation_data):
        return f'''
Прошу вас принять меры в отношении владельца транспортного средства, совершившего нарушение правил остановки и стоянки.

Прошу привлечь к ответственности в соответствии с Кодексом Республики Беларусь об Административных Правонарушениях, Статья 18.22 «Нарушение правил остановки и стоянки транспортного средства, а также иных правил дорожного движения» и ознакомить меня с принятыми мерами.

Cсылки на фотографии:
{violation_data['photos']}

Сведения о нарушителе:

Гос.номер транспортного средства: {violation_data['vehicle_number']}
Место нарушения(адрес): {violation_data['address']}
Дата и время нарушения: {violation_data['datetime']}

{violation_data['remark']}

Прошу зарегистрировать настоящее обращение в соответствии с Законом «Об обращениях граждан и юридических лиц» и в соответствии с требованиями ч. 5 ст. 10 данного Закона и абзацами 6, 13 ст. 22 Закона «Об органах внутренних дел Республики Беларусь» поручить соответствующему подразделению ОВД проведение мероприятий, направленных на установление вышеуказанных лиц с целью привлечения их к соответствующей административной ответственности за нарушение правил стоянки транспортного средства.

Поводом к началу административного процесса в данном случае в соответствии с пунктом 9 Инструкции о порядке приема, регистрации, рассмотрения и учета органами внутренних дел заявлений и сообщений о преступлениях, административных правонарушениях и информации о происшествиях, утвержденной постановлением МВД от 08.01.2019 № 5, прошу считать непосредственное обнаружение признаков административного правонарушения сотрудником ОВД, на рассмотрении которого будет находиться настоящее мое обращение, зарегистрированное в подразделении режимно-секретной деятельности (канцелярии).

Обращаю внимание, что согласно пункту 9 указанной Инструкции непосредственное обнаружение признаков административного правонарушения не заключается в том, чтобы сотрудники ОВД обязательно являлись очевидцами правонарушения, и что в данном случае сотрудником ОВД должен быть составлен рапорт о непосредственном обнаружении признаков административного правонарушения.

В ходе ведения административного процесса я готов(а) предоставить объяснения в качестве свидетеля, так как являюсь очевидцем указанных нарушений ПДД.

На основании части 2 статьи 18 и части 2 статьи 32 Закона РБ «Об информации, информатизации и защите информации» от 10 ноября 2008 г. № 455-З (в редакции от 11.05.2016) требую не разглашать мои персональные данные лицу, в отношении которого ведется административный процесс.

На основании ст. 7 и ч. 5 ст. 25 Закона «Об обращениях граждан и юридических лиц» прошу направить ответ на настоящее обращение на адрес моей электронной почты <b>__EMAIL__</b>, в котором указать сведения о принятых мерах в соответствии с компетенцией органов внутренних дел и требованиями указанных нормативных правовых актов.

С уважением, {violation_data['sender_name']}.

Спасибо за вашу службу!
'''
